In [4]:
import pandas as pd

In [5]:
data_file="C:/Users/sebat/ClassRepository/exercises_class/PANDAS/Class 1/car_purchases.csv"

In [6]:
data_file_df=pd.read_csv(data_file)
data_file_df.head()

   id           Full Name  Gender   Amount       Car
0   1        Minnnie Rean    male  15484.5      Jeep
1   2     Ursa Torricella  female  13443.3    Saturn
2   3     Joyann Pirolini    male   9095.6       Ram
3   4      Sharl Ridsdell  female  11871.6     Dodge
4   5  Laurence Jovasevic    male  13459.8  Chrysler

In [7]:
data_file_df["Amount"].head()

0    15484.5
1    13443.3
2     9095.6
3    11871.6
4    13459.8
Name: Amount, dtype: float64

In [10]:
data_file_df[["Amount","Gender"]].head()

    Amount  Gender
0  15484.5    male
1  13443.3  female
2   9095.6    male
3  11871.6  female
4  13459.8    male

In [16]:
mean=data_file_df["Amount"].mean()

mean

9988.738100000002

In [18]:
sum=data_file_df["Amount"].sum()
sum

9988738.100000001

In [20]:
unique= data_file_df["Car"].unique()
unique

array(['Jeep', 'Saturn', 'Ram', 'Dodge', 'Chrysler', 'Cadillac',
       'Pontiac', 'Nissan', 'Lexus', 'Volkswagen', 'Suzuki', 'Kia',
       'Mercury', 'Audi', 'Bugatti', 'BMW', 'Mazda', 'GMC', 'Ford',
       'Mercedes-Benz', 'Land Rover', 'Chevrolet', 'Toyota', 'Honda',
       'Subaru', 'Oldsmobile', 'MINI', 'Lincoln', 'Mitsubishi', 'Isuzu',
       'Infiniti', 'Eagle', 'Saab', 'Buick', 'Volvo', 'Lotus', 'Maserati',
       'Jensen', 'Hyundai', 'Maybach', 'Corbin', 'Acura', 'Ferrari',
       'Plymouth', 'Studebaker', 'Jaguar', 'Rolls-Royce', 'Aston Martin',
       'Merkur', 'CitroÃ«n', 'Daewoo', 'Tesla', 'Porsche', 'Scion', 'Geo',
       'Hummer', 'Lamborghini', 'Fiat', 'Bentley', 'Peugeot', 'Austin',
       'Spyker'], dtype=object)

In [22]:
count= data_file_df["Gender"].value_counts()
count

Gender
male          455
female        446
non-binary     99
Name: count, dtype: int64

In [24]:
#esto sirve para hacer calculos y agregar columnas a un dataframe.
thousands_of_dollars= data_file_df["Amount"]/1000
data_file_df["Thousands of Dollars"]=thousands_of_dollars
data_file_df.head()

   id           Full Name  Gender   Amount       Car  Thousands of Dollars
0   1        Minnnie Rean    male  15484.5      Jeep               15.4845
1   2     Ursa Torricella  female  13443.3    Saturn               13.4433
2   3     Joyann Pirolini    male   9095.6       Ram                9.0956
3   4      Sharl Ridsdell  female  11871.6     Dodge               11.8716
4   5  Laurence Jovasevic    male  13459.8  Chrysler               13.4598